Repository: beksultanrrr/flutter_flash_chat
Catalog: lib/l10n/intl_*.arb
Languages: ru

source: Enter your number
ru: Введите ваш номер

# enterUDetails
source: Enter your details
ru: Введите ваши данные

source: Name
ru: Имя

source: Charity fund
ru: Благотворительный фонд

# helloAll
source: Greetings to all the good ones
ru: Приветствуем всех отзывчивых!

# startUCharity
source: Start your charity with 100 tenge
ru: Начните свою благотворительность со 100 тенге

# recommendationCompany
source: Recommended fundraising companies
ru: Рекомендованные компании по сбору средств

source: View all
ru: Посмотреть все

source: Donate now
ru: Пожертвовать сейчас

source: Required amount
ru: Необходимая сумма

# collectedAmount
source: The amount collected
ru: Собранная сумма

# shareUBlessings
source: Share your blessings this Ramadan
ru: Поделись своими благословениями в этот Рамадан

# sendAsGift
source: Send as a gift
ru: Отправить в подарок

# onLovedOnes
source: on behalf of loved ones
ru: от имени близких

# donationFor
source: What is your donation for?
ru: На что идет ваше пожертвование?

source: To learn more
ru: Узнать больше

source: Invite friends
ru: Пригласи друзей

# toFightTogether
source: to fight hunger together
ru: чтобы бороться с голодом вместе

# inviteUFriends
source: Invite friends
ru: Пригласить друзей

# inviteSms
source: Join us in supporting charitable initiatives through ${link} Your contribution will make a real difference in the lives of those in need. Let's create a better future together!
ru: Присоединяйтесь к нам в поддержке благотворительных инициатив через {link}! Ваш вклад сделает реальное изменение в жизни нуждающихся. Давайте вместе создадим лучшее будущее!

source: Distribution of donations
ru: Распределение пожертвований

# distributionOfDonationsDecription
source: The dinners you share help us fight hunger today and invest in eradicating hunger forever. The largest share of donations goes directly to feeding hungry families. The rest is invested in the development of our charitable community so that the number of people we help also grows.
ru: Обеды, которыми вы делитесь помогают нам бороться с голодом сегодня и инвестировать в искоренение голода навсегда.Наибольшая доля пожертвований идет непосредственно на кормление голодныхсемей.Оставшаяся часть инвестируется в развитие нашего благотворительного сообщества, чтобы число людей, которым мы помогаем, также росло.

# validFrom
source: Valid from April 2024
ru: Действует с апреля 2024

source: RUNWAY program
ru: Программа ВПП

# rUNWAYProgramSubtitle
source: Directly helps families in need
ru: Напрямую помогает нуждающимся семьям

source: Fundraising
ru: Сбор средств

# fundraisingSubtitle
source: More fundraising using our platform
ru: Больше привлечение средств с помощью нашей платформы

source: Production costs
ru: Производственные расходы

# productionCostsSubtitle
source: Help the WFP to conduct its operations on a local and global level
ru: Помоги WFP проводить свои операций на локальном и глобальном уровне

source: Payment expenses
ru: Платежные расходы

# paymentExpensesSubtitle
source: Covers payment processing and related costs
ru: Охватывает обработку платежей и сопутствующие издержки

# distributionOfDonationsUnderText
source: As we grow, we will be able to cover our expenses, while increasing the amount that will go directly to starving families. According to the WFP strategic plan, an average of 22% will be spent on attracting donations in 2020-2030.
ru: По мере роста мы сможем покрыть наши расходы, при этом увеличив сумму, которая напрямую пойдет голодающим семьям. В соответствии со стратегическим планом ВПП, в 2020–2030 годы на привлечение пожертвований будет потрачено в среднем 22%.

# chooseWhereDonate
source: Choose where you want to donate
ru: Выбери,куда хочешь пожертвовать

# changeTheWord
source: Change the World: Identify your footprint by deciding where to direct your charitable donations.
ru: Измени мир: Определи свой след, решая, куда направить свои благотворительные пожертвования.

source: Emergency situation
ru: Чрезвычайная ситуация

source: Provide vital assistance
ru: Өмірлік көмек көрсетіңіз

source: Review
ru: Обзор

source: Image gallery
ru: Галерея изображений

source: Donate
ru: Пожертвуй

source: The Creator of change
ru: Творец перемен

# fromMarch
source: from March 2024
ru: c марта 2024

# readyFightHunry
source: Are you ready to start the fight against hunger?
ru: Готовы начать борьбу с голодом?

# startGivingCharity
source: Start giving charity to those in need to create a better world for all of us.
ru: Начните давать благотворительность тем, кто нуждается, чтобы создать лучший мир для всех нас.

# doGoodFirstTime
source: Do good for the first time
ru: Сделай добро впервые

source: Share information
ru: Поделиться инорфмацией

# sendGift
source: Send a gift
ru: Отправить подарок

source: Rate us
ru: Оцените нас

source: Settings
ru: Настройки

source: Language
ru: Язык

source: Payment Details
ru: Детали платежа

source: Terms of Use
ru: Условия пользования

source: Feedback
ru: Обратная связь

# leaveReview
source: Leave a review
ru: Оставить отзыв

# contactWithUs
source: Get in touch with us
ru: Свяжись с нами

source: About us
ru: О нас
